In [1]:
import os
print(os.getcwd())
os.chdir('d:/Users/mokky/Documents/GitHub/NUS-ISS/IS02_PT_Capstone_Human_Re-ID')
print(os.getcwd())

d:\Users\mokky\Documents\GitHub\NUS-ISS\IS02_PT_Capstone_Human_Re-ID\notebooks
d:\Users\mokky\Documents\GitHub\NUS-ISS\IS02_PT_Capstone_Human_Re-ID

In [2]:
import sqlite3
from src.database.database import DbQuery
import pandas as pd
import matplotlib.pyplot as plt
import cv2
import numpy as np

In [3]:
db_path = 'database/reid_db_(480-682)_YS.db'
query = "SELECT name FROM sqlite_master WHERE type='table'"
conn_ys = sqlite3.connect(db_path, detect_types=sqlite3.PARSE_DECLTYPES |
                       sqlite3.PARSE_COLNAMES)
cursor_ys = conn_ys.cursor()
cursor_ys.execute(query)
column_names = [desc[0] for desc in cursor_ys.description]
qry_results_ys = pd.DataFrame(cursor_ys.fetchall(), columns=column_names)
print(qry_results_ys)
print(column_names)

                 name
0     sqlite_sequence
1      vectorkb_table
2     inference_table
3         human_table
4  correctlabel_table
['name']

In [5]:
table_name = 'correctlabel_table'
query = f'SELECT * FROM {table_name}'
cursor_ys.execute(query)
column_names = [desc[0] for desc in cursor_ys.description]
print(column_names)
qry_results_ys = pd.DataFrame(cursor_ys.fetchall(), columns=column_names)
display(qry_results_ys.info())
display(qry_results_ys.head())

['img_id', 'is_correct', 'human_id']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   img_id      215 non-null    object
 1   is_correct  215 non-null    int64
 2   human_id    215 non-null    object
dtypes: int64(1), object(2)
memory usage: 5.2+ KB

None

                           img_id  is_correct human_id
0  11_D08N_20210614T221325_137910           1      617
1  11_D08N_20210614T221403_137940           1      617
2  11_SJXB_20210614T165525_123090           1      547
3  11_SJXB_20210614T170022_123270           1      547
4  11_SJXB_20210614T172452_124200           1      547

In [34]:
table_name = 'human_table'
query = f'SELECT * FROM {table_name}'
cursor_ys.execute(query)
column_names = [desc[0] for desc in cursor_ys.description]
print(column_names)
qry_results_ys = pd.DataFrame(cursor_ys.fetchall(), columns=column_names)
display(qry_results_ys.head())

['img_id', 'human_id', 'inference_datetime', 'type']

                       img_id human_id   inference_datetime type
0  16_XVKH_20210612T125929_30        1  2021-06-15 12:21:42  New
1   3_3OMW_20210612T125934_30        2  2021-06-15 12:21:42  New
2   3_P0ZK_20210612T125950_30        3  2021-06-15 12:21:43  New
3   3_GUB6_20210612T125956_30        4  2021-06-15 12:21:43  New
4   3_GUB6_20210612T130224_90        5  2021-06-15 12:21:43  New

In [35]:
table_name = 'inference_table'
query = f'SELECT * FROM {table_name}'
cursor_ys.execute(query)
column_names = [desc[0] for desc in cursor_ys.description]
print(column_names)
qry_results_ys = pd.DataFrame(cursor_ys.fetchall(), columns=column_names)
display(qry_results_ys.head())

['inference_id', 'query_img_id', 'query_img', 'match_1_img_id', 'match_1_img', 'match_1_dist', 'match_2_img_id', 'match_2_img', 'match_2_dist', 'match_3_img_id', 'match_3_img', 'match_3_dist', 'inference_datetime']

,inference_id,query_img_id,query_img,match_1_img_id,match_1_img,match_1_dist,match_2_img_id,match_2_img,match_2_dist,match_3_img_id,match_3_img,match_3_dist,inference_datetime
0,24315,16_XVKH_20210612T125929_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,None,NaN,None,None,NaN,None,None,NaN,2021-06-15 12:21:42
1,24316,3_3OMW_20210612T125934_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.211681,None,None,NaN,None,None,NaN,2021-06-15 12:21:42
2,24317,3_P0ZK_20210612T125950_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.630488,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.322684,None,None,NaN,2021-06-15 12:21:43
3,24318,3_GUB6_20210612T125956_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.503716,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.368630,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.215568,2021-06-15 12:21:43
4,24319,3_GUB6_20210612T130224_90,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.629281,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.356152,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.324396,2021-06-15 12:21:43

In [36]:
table_name = 'correctlabel_table'
query = f'SELECT m.img_id AS img_id, m.is_correct AS is_correct, h.human_id AS human_id FROM {table_name} AS m'
query += " INNER JOIN human_table AS h ON h.img_id=m.img_id"
cursor_ys.execute(query)
column_names = [desc[0] for desc in cursor_ys.description]
print(column_names)
qry_results_ys = pd.DataFrame(cursor_ys.fetchall(), columns=column_names)
display(qry_results_ys.head())
display(qry_results_ys.nunique())
display(qry_results_ys.human_id.unique())

['img_id', 'is_correct', 'human_id']

                           img_id  is_correct human_id
0  11_D08N_20210614T221325_137910           1      617
1  11_D08N_20210614T221403_137940           1      617
2  11_SJXB_20210614T165525_123090           1      547
3  11_SJXB_20210614T170022_123270           1      547
4  11_SJXB_20210614T172452_124200           1      547

img_id        215
is_correct      2
human_id       61
dtype: int64

array(['617', '547', '555', '508', '546', '507', '519', '523', '583',
       '569', '526', '594', '597', '521', '595', '568', '567', '625',
       '596', '551', '643', '653', '494', '497', '631', '633', '608',
       '645', '591', '615', '592', '634', '675', '627', '563', '632',
       '486', '613', '506', '502', '611', '552', '557', '670', '671',
       '672', '493', '496', '488', '649', '624', '663', '619', '639',
       '646', '621', '612', '562', '605', '513', '530'], dtype=object)

In [37]:
db_path = 'database/reid_db_labelling (341-479)DC.db'
query = "SELECT name FROM sqlite_master WHERE type='table'"
conn_dc = sqlite3.connect(db_path, detect_types=sqlite3.PARSE_DECLTYPES |
                       sqlite3.PARSE_COLNAMES)
cursor_dc = conn_dc.cursor()
cursor_dc.execute(query)
column_names = [desc[0] for desc in cursor_dc.description]
qry_results_dc = pd.DataFrame(cursor_dc.fetchall(), columns=column_names)
print(qry_results_dc)
print(column_names)

                 name
0     sqlite_sequence
1      vectorkb_table
2     inference_table
3         human_table
4  correctlabel_table
['name']

In [38]:
table_name = 'correctlabel_table'
query = f'SELECT m.img_id AS img_id, m.is_correct AS is_correct, h.human_id AS human_id FROM {table_name} AS m'
query += " INNER JOIN human_table AS h ON h.img_id=m.img_id"
cursor_dc.execute(query)
column_names = [desc[0] for desc in cursor_dc.description]
print(column_names)
qry_results_dc = pd.DataFrame(cursor_dc.fetchall(), columns=column_names)
display(qry_results_dc.head())
display(qry_results_dc.nunique())
display(qry_results_dc.human_id.unique())

['img_id', 'is_correct', 'human_id']

                          img_id  is_correct human_id
0  11_2W41_20210614T060558_94380           1      345
1  11_2W41_20210614T060638_94410           1      345
2  11_2W41_20210614T060718_94440           1      345
3  11_2W41_20210614T060757_94470           1      345
4  11_CKF6_20210614T045857_91170           1      407

img_id        166
is_correct      2
human_id       53
dtype: int64

array(['345', '407', '405', '372', '389', '392', '402', '347', '348',
       '386', '357', '373', '375', '379', '427', '374', '477', '468',
       '470', '344', '391', '351', '449', '358', '455', '350', '451',
       '416', '445', '356', '346', '443', '462', '466', '452', '456',
       '458', '465', '442', '447', '459', '403', '404', '359', '444',
       '457', '436', '362', '435', '343', '437', '469', '453'],
      dtype=object)

In [39]:
#check if duplicate
display(qry_results_ys[qry_results_ys.img_id.isin(qry_results_dc.human_id.unique())])

Empty DataFrame
Columns: [img_id, is_correct, human_id]
Index: []

In [15]:
listMerge = [["347", "348"]]
df = pd.DataFrame({'merges': [','.join(item) for item in listMerge]})
print(df.info())
print(df)
with sqlite3.connect('database/reid_db_merging.db', detect_types=sqlite3.PARSE_DECLTYPES |
                     sqlite3.PARSE_COLNAMES) as conn:
    df.to_sql("merge_table", con=conn,
              index=False, if_exists='replace')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   merges  1 non-null      object
dtypes: object(1)
memory usage: 136.0+ bytes
None
    merges
0  347,348

In [17]:

listMerge = [["347", "348"]]
df = pd.DataFrame({'merges': [','.join(item) for item in listMerge]})
print([row[0].split(',') for _, row in df.iterrows()])

[['347', '348']]

In [25]:
db_path = 'database/reid_db_merging.db'
query = "SELECT name FROM sqlite_master WHERE type='table'"
conn = sqlite3.connect(db_path, detect_types=sqlite3.PARSE_DECLTYPES |
                          sqlite3.PARSE_COLNAMES)
cursor = conn.cursor()
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
print(qry_results)
print(column_names)

Empty DataFrame
Columns: [name]
Index: []
['name']

In [26]:
table_name = 'merge_table'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
print(column_names)
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.head())

OperationalError: no such table: merge_table